; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	spectrograph0 - mode
	infrared3 - mode
	spectrograph4 - mode
	Star1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(have_image Star6 spectrograph2)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 thermograph1)
	(have_image Planet9 infrared3)
	(have_image Star10 infrared3)
	(have_image Star11 spectrograph2)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 infrared3)
	(have_image Planet15 thermograph1)
	(have_image Planet16 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation3 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 11
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 11
3. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 11
4. (turn_to satellite0 star6 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star6)
   goals met: 0 of 11
5. (take_image satellite0 star6 instrument2 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 1 of 11
6. (turn_to satellite0 star11 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star11)
   goals met: 1 of 11
7. (take_image satellite0 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 2 of 11
8. (turn_to satellite0 planet15 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet15)
   goals met: 2 of 11
9. (take_image satellite0 planet15 instrument2 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon12 instrument2 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 4 of 11
12. (turn_to satellite0 star8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star8)
   goals met: 4 of 11
13. (take_image satellite0 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 5 of 11
14. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 5 of 11
15. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 11
16. (turn_to satellite0 groundstation2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 11
17. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 5 of 11
18. (turn_to satellite0 phenomenon13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 11
19. (take_image satellite0 phenomenon13 instrument1 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 6 of 11
20. (turn_to satellite0 phenomenon7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 11
21. (take_image satellite0 phenomenon7 instrument1 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 7 of 11
22. (turn_to satellite0 planet16 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet16)
   goals met: 7 of 11
23. (take_image satellite0 planet16 instrument1 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 8 of 11
24. (turn_to satellite0 planet9 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet9)
   goals met: 8 of 11
25. (take_image satellite0 planet9 instrument1 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 9 of 11
26. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 9 of 11
27. (take_image satellite0 star10 instrument1 infrared3)
   added: (have_image star10 infrared3)
   goals met: 10 of 11
28. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 10 of 11
29. (take_image satellite0 star14 instrument1 infrared3)
   added: (have_image star14 infrared3)
   goals met: 11 of 11
